// Разнообразные технические символы
export const Tech = new Map();

Tech.set(0x7F, 0x2302); // ⌂ (U+2302: House)         
Tech.set(0xF2, 0x00BB); // » (Закрывающая правая кавычка «ёлочка» U+00BB)  
Tech.set(0xF3, 0x00AB); // « (Открывающая левая кавычка «ёлочка» U+00AB) 
Tech.set(0xF4, 0x201C); // “ (Закрывающая двойная кавычка U+201C) 
Tech.set(0xF5, 0x201E); // „ (Нижняя двойная открывающая кавычка U+201E)
Tech.set(0xF6, 0x00D7); // × (Знак умножения U+00D7)
Tech.set(0xF7, 0x2248); // ≈ (Почти равный U+2248)
Tech.set(0xF8, 0x00B0); // ° (Знак градуса U+00B0)
Tech.set(0xF9, 0x25CB); // ○ (Белый круг U+25CB)
Tech.set(0xFA, 0x2027); // ‧ (Точка переноса U+2027)
Tech.set(0xFB, 0x221A); // √ (Квадратный корень U+221A)
Tech.set(0xFC, 0x2116); // № (Знак номера U+2116)
Tech.set(0xFD, 0x22C6); // ⋆ (Оператор звёздочка U+22C6 )
Tech.set(0xFE, 0x25A1); // □ (Белый квадрат U+25A1)